simple-travel-agency.yaml

# Script generated by Blazemeter Chrome Extension

execution:
  - scenario: SIMPLE_TRAVEL_AGENCY
    concurrency: 20
    ramp-up: 1m
    hold-for: 19m
scenarios:
  SIMPLE_TRAVEL_AGENCY:
    headers:
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.70 Safari/537.36'
    requests:
      - transaction: Load App
        force-parent-sample: false
        do:
          - url: 'http://www.blazedemo.com/'
            method: GET
            label: 'http://www.blazedemo.com/'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
          - url: 'http://ajax.googleapis.com/ajax/libs/jquery/2.0.0/jquery.min.js'
            method: GET
            label: 'http://ajax.googleapis.com/ajax/libs/jquery/2.0.0/jquery.min.js'
            headers:
              Accept: '*/*'
          - url: 'http://www.blazedemo.com/assets/bootstrap.min.js'
            method: GET
            label: 'http://www.blazedemo.com/assets/bootstrap.min.js'
            headers:
              Accept: '*/*'
          - url: 'http://www.blazedemo.com/assets/bootstrap-table.js'
            method: GET
            label: 'http://www.blazedemo.com/assets/bootstrap-table.js'
            headers:
              Accept: '*/*'
          - url: 'https://js-agent.newrelic.com/nr-1130.min.js'
            method: GET
            label: 'https://js-agent.newrelic.com/nr-1130.min.js'
            headers:
              Accept: '*/*'
          - url: 'https://bam.nr-data.net/1/338cffe5d3'
            method: GET
            label: 'https://bam.nr-data.net/1/338cffe5d3'
            headers:
              Accept: '*/*'
            body:
              a: '6657625'
              v: 1130.54e767a
              to: YVxSYxACCxcEVRFfWlgWcVQWCgoKSg==
              rst: '2678'
              ref: 'http://www.blazedemo.com/'
              ap: '9'
              be: '1312'
              fe: '2366'
              dc: '2221'
              perf: '{"timing":{"of":1571847626970,"n":0,"u":1078,"ue":1078,"f":1,"dn":3,"dne":59,"c":59,"ce":182,"rq":182,"rp":1075,"rpe":1076,"dl":1081,"di":2220,"ds":2220,"de":2224,"dc":2365,"l":2366,"le":2368},"navigation":{"ty":1}}'
              fp: '2239'
              fcp: '2239'
              at: TRtRFVgYGBk=
              jsonp: NREUM.setToken
      - transaction: Choose Destinations
        force-parent-sample: false
        do:
          - url: 'http://www.blazedemo.com/reserve.php'
            method: POST
            label: 'http://www.blazedemo.com/reserve.php'
            think-time: 16686ms
            headers:
              Origin: 'http://www.blazedemo.com'
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
            body:
              fromPort: Paris
              toPort: Buenos Aires
          - url: 'http://ajax.googleapis.com/ajax/libs/jquery/2.0.0/jquery.min.js'
            method: GET
            label: 'http://ajax.googleapis.com/ajax/libs/jquery/2.0.0/jquery.min.js'
            headers:
              Accept: '*/*'
          - url: 'http://www.blazedemo.com/assets/bootstrap.min.js'
            method: GET
            label: 'http://www.blazedemo.com/assets/bootstrap.min.js'
            headers:
              Accept: '*/*'
          - url: 'http://www.blazedemo.com/assets/bootstrap-table.js'
            method: GET
            label: 'http://www.blazedemo.com/assets/bootstrap-table.js'
            headers:
              Accept: '*/*'
          - url: 'https://js-agent.newrelic.com/nr-1130.min.js'
            method: GET
            label: 'https://js-agent.newrelic.com/nr-1130.min.js'
            headers:
              Accept: '*/*'
          - url: 'https://bam.nr-data.net/1/338cffe5d3'
            method: GET
            label: 'https://bam.nr-data.net/1/338cffe5d3'
            headers:
              Accept: '*/*'
            body:
              a: '6657625'
              v: 1130.54e767a
              to: YVxSYxACCxcEVRFfWlgWcVQWCgoKSkQARVBET1UZEgsV
              rst: '2501'
              ref: 'http://www.blazedemo.com/reserve.php'
              ap: '9'
              be: '1096'
              fe: '2470'
              dc: '2295'
              perf: '{"timing":{"of":1571847646325,"n":0,"u":863,"ue":863,"f":8,"dn":8,"dne":8,"c":8,"ce":8,"rq":12,"rp":859,"rpe":860,"dl":866,"di":2294,"ds":2294,"de":2311,"dc":2468,"l":2469,"le":2473},"navigation":{}}'
              fp: '2315'
              fcp: '2315'
              at: TRtRFVgYGBk=
              jsonp: NREUM.setToken
      - transaction: Choose Flight
        force-parent-sample: false
        do:
          - url: 'http://www.blazedemo.com/purchase.php'
            method: POST
            label: 'http://www.blazedemo.com/purchase.php'
            think-time: 5957ms
            headers:
              Origin: 'http://www.blazedemo.com'
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
            body:
              airline: Virgin America
              flight: '12'
              fromPort: Paris
              price: '765.32'
              toPort: Buenos Aires
          - url: 'http://ajax.googleapis.com/ajax/libs/jquery/2.0.0/jquery.min.js'
            method: GET
            label: 'http://ajax.googleapis.com/ajax/libs/jquery/2.0.0/jquery.min.js'
            headers:
              Accept: '*/*'
          - url: 'http://www.blazedemo.com/assets/bootstrap.min.js'
            method: GET
            label: 'http://www.blazedemo.com/assets/bootstrap.min.js'
            headers:
              Accept: '*/*'
          - url: 'http://www.blazedemo.com/assets/bootstrap-table.js'
            method: GET
            label: 'http://www.blazedemo.com/assets/bootstrap-table.js'
            headers:
              Accept: '*/*'
          - url: 'https://js-agent.newrelic.com/nr-1130.min.js'
            method: GET
            label: 'https://js-agent.newrelic.com/nr-1130.min.js'
            headers:
              Accept: '*/*'
          - url: 'https://bam.nr-data.net/1/338cffe5d3'
            method: GET
            label: 'https://bam.nr-data.net/1/338cffe5d3'
            headers:
              Accept: '*/*'
            body:
              a: '6657625'
              v: 1130.54e767a
              to: YVxSYxACCxcEVRFfWlgWcVQWCgoKSkYQRFZeWENSTBMNFA==
              rst: '3653'
              ref: 'http://www.blazedemo.com/purchase.php'
              ap: '10'
              be: '579'
              fe: '3605'
              dc: '3393'
              perf: '{"timing":{"of":1571847654785,"n":0,"u":499,"ue":499,"f":6,"dn":6,"dne":6,"c":6,"ce":6,"rq":10,"rp":496,"rpe":497,"dl":502,"di":3393,"ds":3393,"de":3405,"dc":3604,"l":3605,"le":3609},"navigation":{}}'
              fp: '3410'
              fcp: '3410'
              at: TRtRFVgYGBk=
              jsonp: NREUM.setToken
      - transaction: Book Flight
        force-parent-sample: false
        do:
          - url: 'http://www.blazedemo.com/confirmation.php'
            method: POST
            label: 'http://www.blazedemo.com/confirmation.php'
            think-time: 29094ms
            headers:
              Origin: 'http://www.blazedemo.com'
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
            body:
              _token: ''
              address: 123 Main St.
              cardType: visa
              city: Kansas City
              creditCardMonth: '11'
              creditCardNumber: '23232424242'
              creditCardYear: '2020'
              inputName: John G
              nameOnCard: John G
              state: MO
              zipCode: '64106'
          - url: 'http://ajax.googleapis.com/ajax/libs/jquery/2.0.0/jquery.min.js'
            method: GET
            label: 'http://ajax.googleapis.com/ajax/libs/jquery/2.0.0/jquery.min.js'
            headers:
              Accept: '*/*'
          - url: 'http://www.blazedemo.com/assets/bootstrap.min.js'
            method: GET
            label: 'http://www.blazedemo.com/assets/bootstrap.min.js'
            headers:
              Accept: '*/*'
          - url: 'http://www.blazedemo.com/assets/bootstrap-table.js'
            method: GET
            label: 'http://www.blazedemo.com/assets/bootstrap-table.js'
            headers:
              Accept: '*/*'
          - url: 'https://js-agent.newrelic.com/nr-1130.min.js'
            method: GET
            label: 'https://js-agent.newrelic.com/nr-1130.min.js'
            headers:
              Accept: '*/*'
          - url: 'https://bam.nr-data.net/1/338cffe5d3'
            method: GET
            label: 'https://bam.nr-data.net/1/338cffe5d3'
            headers:
              Accept: '*/*'
            body:
              a: '6657625'
              v: 1130.54e767a
              to: YVxSYxACCxcEVRFfWlgWcVQWCgoKSlUKWFNfS11WFgoKCktGDUY=
              rst: '2952'
              ref: 'http://www.blazedemo.com/confirmation.php'
              ap: '11'
              be: '767'
              fe: '2918'
              dc: '2807'
              perf: '{"timing":{"of":1571847687532,"n":0,"u":521,"ue":521,"f":4,"dn":4,"dne":4,"c":4,"ce":4,"rq":7,"rp":518,"rpe":519,"dl":524,"di":2806,"ds":2806,"de":2835,"dc":2916,"l":2917,"le":2919},"navigation":{}}'
              fp: '2838'
              fcp: '2838'
              at: TRtRFVgYGBk=
              jsonp: NREUM.setToken